

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Предопределенный Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Ни хуя не работает";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСравнение(Команда)
	ЗапуститьСравнениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьСравнениеНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
